# App Descriptor for Fiori Launchpad (FLP) tile

#NOTR
appTitle=i18n demo app
#NOTR
appDescription=A simple demo app for typical i18n issues

# Page title

#NOTR
panelHeaderText=i18n Translatability Issues - Demo

#NOTR
changeLocaleLabel=Type in your locale
#NOTR
changeLocaleButton=Load samples in your locale
#NOTR
changeLocaleInformation=If there're no translations for the given locale, the i18n samples will eb shown in English.

#NOTR
genericActionDescription=Visualize the i18n issue in your language! Go to TEW, translate the i18n.properties resource file and display the sample below in your locale.

# Hard-coded strings

#NOTR
hardCodedStringsTab=Hard-coded Strings
#NOTR
hardCodedStringsIssueDescription=Hard-coded strings will always be dispalyed in the original language although the locale of the application has changed.
#NOTR
hardCodedStringsAfterActionDescription=After translation the string of the center tile will remain in English.
sampleText1=[[[\u0162\u0157\u0105\u014B\u015F\u013A\u0105\u0163\u0105\u0183\u013A\u0113 \u0163\u0113\u03C7\u0163 \u0105\u0163 \u012F\u014B \u0163\u0125\u0113 \u0192\u012F\u0157\u015F\u0163 \u0163\u012F\u013A\u0113.\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219]]]
sampleText2=[[[\u0162\u0157\u0105\u014B\u015F\u013A\u0105\u0163\u0105\u0183\u013A\u0113 \u0163\u0113\u03C7\u0163 \u0105\u0163 \u0163\u0125\u0113 \u013A\u0105\u015F\u0163 \u0163\u012F\u013A\u0113.\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219]]]

# Composite Messages

#NOTR
compositeMessagesTab=Composite Messages
#NOTR
compositeMessagesIssueDescription=Sentence-like composite messages assume a particular order for the words in a sentence that may need to be different in another language.
#NOTR
compositeMessagesAfterActionDescription=Depending on your language, you may want to change the arrangement of the label description and the dropdown list in order to achieve a good translation. As this isn't possible you need to reword the UI texts to resolve this issue.
dropdownListLabel=[[[\u016E\u03C1\u018C\u0105\u0163\u0113 \u0163\u0125\u0113 \u0105\u03C1\u03C1\u013A\u012F\u010B\u0105\u0163\u012F\u014F\u014B\u2219\u2219\u2219\u2219\u2219]]]
dropdownListItem1Text=[[[\u0105\u014B\u0177\u0163\u012F\u0271\u0113\u2219\u2219\u2219\u2219\u2219\u2219\u2219]]]
dropdownListItem2Text=[[[\u0113\u028B\u0113\u0157\u0177 3 \u0271\u014F\u014B\u0163\u0125\u015F\u2219\u2219\u2219\u2219\u2219]]]
dropdownListItem3Text=[[[\u0113\u028B\u0113\u0157\u0177 6 \u0271\u014F\u014B\u0163\u0125\u015F\u2219\u2219\u2219\u2219\u2219]]]
dropdownListItem4Text=[[[\u0113\u028B\u0113\u0157\u0177 \u0177\u0113\u0105\u0157\u2219\u2219\u2219\u2219]]]

#Concatenations

#NOTR
concatenationsTab=Concatenations
#NOTR
concatenationsIssueDescription=Composite messages consisting of incomplete strings (concatenations) cannot be reordered by the translator.
#NOTR
concatenationsAfterActionDescription=If the message needs to be reordered in your language in a way that the total number of log entries is mentioned before the number of last entries, the message that appears when you click the first button won\u00C2\u00B4t be correct any longer.
lastEntriesNumberLabel=[[[\u0143\u0171\u0271\u0183\u0113\u0157 \u014F\u0192 \u013A\u0105\u015F\u0163 \u0113\u014B\u0163\u0157\u012F\u0113\u015F\u2219\u2219\u2219\u2219\u2219]]]
totalEntriesNumberLabel=[[[\u0143\u0171\u0271\u0183\u0113\u0157 \u014F\u0192 \u0163\u014F\u0163\u0105\u013A \u0113\u014B\u0163\u0157\u012F\u0113\u015F\u2219\u2219\u2219\u2219\u2219\u2219]]]
numberFieldValidationError=[[[\u0162\u0125\u0113 \u0113\u014B\u0163\u0113\u0157\u0113\u018C \u028B\u0105\u013A\u0171\u0113 \u0271\u0171\u015F\u0163 \u0183\u0113 \u0105 \u014B\u0171\u0271\u0183\u0113\u0157 \u0105\u014B\u018C \u0271\u0171\u015F\u0163 \u014B\u014F\u0163 \u0113\u03C7\u010B\u0113\u0113\u018C 5000.\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219\u2219]]]
concatenatedString1=[[[\u0158\u0113\u0163\u0157\u012F\u0113\u028B\u012F\u014B\u011F \u013A\u0105\u015F\u0163\u2219\u2219\u2219\u2219]]]
concatenatedString2=[[[\u014F\u0192\u2219\u2219]]]
concatenatedString3=[[[\u0113\u014B\u0163\u0157\u012F\u0113\u015F.\u2219\u2219\u2219\u2219\u2219\u2219]]]
#NOTR
concatenatedStringButtonText=Show message as concatenated string
#NOTR
concatenatedStringSolutionsButtonText=Show message as full sentence with variables
fullSentenceMessage=[[[\u0158\u0113\u0163\u0157\u012F\u0113\u028B\u012F\u014B\u011F \u013A\u0105\u015F\u0163 {0} \u014F\u0192 {1} \u0113\u014B\u0163\u0157\u012F\u0113\u015F.]]]
#NOTR
concatenationsSolutionDescription=Use full sentences and numbered variables to avoid this issue.

#Truncated strings

#NOTR
truncatedStringsTab=Truncated Strings
#NOTR
truncatedStringsIssueDescription=Strings exceeding the width of a UI element appear truncated in the application.
#NOTR
truncatedStringsActionDescription=Type a string of arbitrary length into the input field and click on the button.
#NOTR
truncatedStringsAfterActionDescription=If the string exceeds a certain length it will appear truncated in the UI element.
truncatedStringsLabel=[[[\u0162\u0177\u03C1\u0113 \u015F\u014F\u0271\u0113 \u0163\u0113\u03C7\u0163 \u0125\u0113\u0157\u0113:\u2219\u2219\u2219\u2219]]]
truncatedStringsButtonText=[[[\u015C\u0125\u014F\u0175 \u0163\u0113\u03C7\u0163 \u012F\u014B \u0183\u0171\u0163\u0163\u014F\u014B\u2219\u2219\u2219\u2219\u2219]]]
#NOTR
truncatedStringsSolutionDescription=Add length restriction meta-data to your resource files for translation or delegate layout calculations to auto-layout systems to avoid truncated strings.




